[
    {
        "story_id": 1,
        "mark": "story",
        "story_title": "How did Rocky come to the Meow Kingdom?",
        "story_chapter": "1",
        "story_sub": "You means how did I become a software engineer here? That's a long story...",
        "story_content": 
        [
            "Actually, originally I come from a town outside of the Yah-Den Mainland and work as a freelancer. My home was decorated into a adorable place with a lot of plushies. Although staying up late for doing projects is painful. But when I was sleeping along with plushies, or eating chocolate meow cookie while listehing to music with plushie holding by me, I can always relieve a little.",
            "One day when I finished my current project and was hanging out, I met some travellers who said that they comes from the Meow Kingdom. I made friends with them, but then I become more and more curious about it, then started asking them a lot about that kingdom. Listening to what they said, my interest at the Meow Kingdom became better and better.",
            "I played well with them for a few days, until they returned to Meow Kingdom. I also got some new projece and returned to those days completing projects",
            "But, I decided to go to that place to have a look",
            "A few days after that, I delayed all my ongoing project and took a boat to that place.",
            "And that's my first time coming to that amazing place. ",
            "I once thought that it might just a regular place, but this trip is out of my imagine! Everyone here seemed so energetic and were filled with pleasure. \"What a colorful place!\" I thought, completly forgot my project.",
            "Later I also met my friend I've made those days. They're really excited to see me coming here with such a surprising face. So they took me around the whle kingdom, and told me that there were also many other wonderful places in the YaDian Land, such as Cherry Blossom Village, Meow Devildom, Meow forest and more.",
            "I started loving such a place, and eventually decided to move to here!",
            "The next day, I went back to my town, then immediately started my plan moving to the Meow Kingdom, since it's really a nice place for such a busy cat like me! ",
            "From then on, I'm a member of Meow Kingdom! "
        ]
    },
    {
        "story_id": 2,
        "mark": "story",
        "story_title": "Two brown cats.",
        "story_chapter": "1",
        "story_sub": "It's hard to believe that I'm making new friends right after I moved here!",
        "story_content": [
            "When I was moving to the Meow Kingdom, I chose to live in a regular 2 floor house with a smaller backyard. As I'm moving with almost all of my things, including all my plushies. I set my bedroom which is also workroom to the 2nd floor. ",
            "After everything is arranged, my life in the Meow kingdom, started! ",
            "After the first day as a resident of the Meow Kingdom. I got an email from someone called Hideki. In the email, he said that he found a white cat with a red ribbon (me) jumping excitedly on the street of Meow Kingdom when he was travelling here from the Meow Devildom a few days ago. Later he knew that I'm Rocky, the cat who can help other cats do the project. While he knows that I've moved here, he'd like to come and meet me. ",
            "Right after I read it, I heard someone knocking the door. I came downstair in fast speed, arrived at the door. ",
            "\"Who's there?\" I asked. ",
            "\"I'm Hideki! Jubby told me that you should be living here, I'm comin' to meet you as what I've said in email!\" ",
            "Feeling surprised, I opened the door. What came into my eye was a brown cat with a white shirt. He looks taller than me, however, he didn't seems to be old. ",
            "\"Hi! Rocky!\" Hideki said excitedly, shaking my hand. ",
            "Seeing such a enthusiastic cat, I'm completly froze, with a embarrassing face. ",
            "During the first meet, we talked alot, from life to hobby. It lasted from that morning to the noon. We quickly became close friends. And when we leave, we shared our contact informations. ",
            "\"Yo!\" Right after he leave, I heard someone calling at me and walking toward me. ",
            "\"Seems that you've been getting on well with Hideki while it's the 1st day you meet him! I'm Jubby, nice to meet you.\" ",
            "I quickly moved my eye to that cat. She's also a brown cat, but with a pixelated sunglasses on her head and wearing a sky blue hoodie. ",
            "\"Uh... hi...\" I said, feeling a little shy. ",
            "But then, Jubby said with smile. : \"Be brave, in the YaDian land, everyone is friendly to each other!\" ",
            "She told me that she was a foreign traveller who currently also lives in Meow Devildom. She talked about many interesting things she had seen during her stay in this land. Sooner we also became friends. Before she leaves, she recommended me many place I should go and have a look in the YaDian land. ",
            "I decided to go and have a look! But before that, I think I should decorate my new home well first... "
        ]
    },
    {
        "story_id": 3,
        "mark": "story",
        "story_title": "My amazing journey of decorating home.",
        "story_chapter": "1",
        "story_sub": "Hmm… It's time to make my new home a satisfying place for me!",
        "story_content": [
            "In fact, I've been eager to customize my home before moving into the meow Kingdom, however, because of several reasons, I can't do that. But after moving here, these reasons could no longer limit me, so this time, I'm going to give my new home a full decoration! ",
            "I would be recording them into a note in order to ensure that nothing will be forgotten. ",
            "First thing I'd like to do is paint the whole outer wall into white color before I do anything else. Then, I'd like to paint blue bold landscape lines on the wall, but then, when thinking about interior, I became unsure about what to add else… ",
            "Then I realized that I was poor at interior designing… ",
            "I decided to walk around the kingdom for inspirations. ",
            "It was really a nice day outside, kitties on the street are enjoying their life. I was walking on the street, looking around for something special. ",
            "Some of those cats seeing me for the first time was curious, as a male cat with a ribbon on his head is really rare. But I wasn't so interested in them, only holding the note, being anxious about the decoration of my home. ",
            "I was out of the home until sunset, when I was depressingly going home with no modification made in the note. At this moment, even the statue of Meow goddess couldn't help me. ",
            "Suddenly, I paid attention to a little purple cat with a big lollipop, who's not so far away from me. That cat quickly spotted me too. ",
            "\"Hi.\" that little cat waved at me. ",
            "\"Uh… Hi.\" I greeted back. ",
            "\"You don't seem to be happy, is there anything that confused you?\" ",
            "\"Uh… no\" I replied, attempting to get away. ",
            "\"Uh... hi...\" I said, feeling a little shy. ",
            "\"Come on! You indeed have some trouble!\" That purple cat said, coming towards me. \"My name is Dream Cat! My giant lollipop can help you make your dream come true!\" ",
            "I looked at his giant lollipop with doubt, as I didn't think how amazing a lollipop could be. But I'd like to see how amazing it could be, so I replied him what I was confused about. ",
            "\"Well… I'm quite not sure how to decorate my home well, I felt that I'm lacking inspiration.\" I said, showing my note to him. ",
            "The Dream Cat looked at my note, smiled, swinging his lollipop, told me: \"Don't worry, you'll soon find your inspirations!\" ",
            "At that moment, I felt that there was something magical in that lollipop. ",
            "I looked up at the sky, it's getting darker, but the thing is becoming different this time. ",
            "I saw the thing I had never seen for a long time. It was a beautiful, starry night sky. What's more amazing, those stars seem to be in sky-blue, my favorite color!! Just then, a rainbow amazingly cut through the sky! ",
            "Such a beautiful scene quickly pulled me out of the depressing mood, made me energetic again. I took out my keychain, with a rounded shaped acrylic yellow star on it. I suddenly got an inspiration. Meanwhile I also thought a new logo for myself: a sky-blue round-shaped star! ",
            "\"Seems that you got the inspiration!\" The Dream cat said. ",
            "\"Yes, I know, I know! Thank you!\" I said excitedly, \"Btw, I'm Rocky! You're so amazing!\" I thanked the Dream Cat in great joy, and became friends with him. ",
            "I finished the note of what I'd like to decorate, then went home, under the beautiful night sky. ",
            "The next day, I took out the tool I prepared before and was ready to decorate my home. But a cat pass by told me that I can find Lei Er for help. Then, under his help, I took some draft of my new home and found Lei Er. I told him my situation. He accepted my request. Then I took him in front of my home, took out the material I prepared in advance as he required. I took out my note and my draft, asking him to finish everything except interior. ",
            "Lei Er looked at them for a while, smiled, then equipped his hammer, running towards those materials and my house, then swung his hammer, jumped up. ",
            "\"Construct!\" ",
            "As he shouted, he whacked right in front of the material heavily. ",
            "Suddenly, all those materials gathered together, shining magically, flying to my house. ",
            "After a bright light, I saw that my house amazingly became what it looked like in the draft! ",
            "I thanked and paid Lei Er coins, after that, I believed that the Ya Dian land must be a super amazing place! Later, I spent a lot of time using my tool to finish my interior. At this moment, the house is finished! Now I'd like to take a tour in such a amazing land! ",
            {"object": "<div class=\"note\"><p>Home decoration note &nbsp;</p><hr><ul><li>With white as the base color of the outside wall. </li><li>With landscape stripes where there were windows in both 1F and 2F</li><li>All roofs are in sky blue color</li><li>Modern style windows</li><li>Sky blue wall in the house.</li><li>Plenty of round shaped stars in the house! Such as the lamp, walls… And of course, my new logo on the front door!</li></ul></div>"}
        ]
    },
    {
        "story_id": 4,
        "mark": "story",
        "story_title": "Travel to the Sky Islands - Part A",
        "story_chapter": "1",
        "story_sub": "I'm sure this trip will be exciting!",
        "story_content": [
            "Everything is ready! But I'm still unsure about where to go first. ",
            "One day, when I'm walking along the main street, I felt that there were giant dark shadow flying past me. When I looked up, I was surprised to see that they were giant birds! I was really frightened because it was my first time seeing them. Meanwhile, a blue cat, but with fluffy white fur on her head, tail and around her waist, looking like a sheep, came over. \"Ex… Excuse me…\" I asked. \"Who are they…? Where do they come from?\" My body was trembling all the time. Seeing me being afraid of them that much, she laughed: \"These are giant birds from the Sky Islands! You look scared… Is this your first time seeing them?\" I nodded. \"So… Are you new to this place?\" she then said, I nodded again. \"Well,\" she smiled, \"There are plenty of amazing things in the Yah-Den Mainland! This is just one of them. When you travel around many other places, you'll see more. By the way, I'm Meimei, the dream defender!\" At this moment, Meows begun gathering to the Meow Goodness statue. \"Looks like the show is going to start! See you later!\" Then she rushed to the statue. Feeling curious, I decided to take a look in the Sky Islands! ",
            "Now I knew that there were Sky Islands, but I don't know where are they. So I decided to find Meimei again and ask her about that. I went towards the crowd in front of the statue. However, there were so many meows that I can't figure out where's Meimei. I jumped over, and saw that it was a purple cat that looks just like Dream Cat playing hand puppet. Her excellent skill drew my attention, and I ended up watching his show until it was over. \"This is Choushi performing to you, thank you all for watching today.\" After saying this, the purple cat packed her hand puppets up and went away. ",
            "As she goes, meows around started to disperse, and I finally found Meimei walking away. I caught her and asked \"So where's the Sky Islands? I'd like to go and have a look!\" \"Go all the way south, through the meow forest, you'll see Wudons' house, those Sky Islands is on the left of it.\" After saying them, Meimei went away. ",
            "\"Through the Meow Forest? That would be a long journey…\" I thought. At that moment, I've already heard of the fact that I can actually use the teleport stone in the square to warp to different places. I went to the square, seeing that giant purple crystal floating on a platform. \"So… All I need to do is just thinking about where to go in front of the crystal?\" \"I want to go to Sky Islands…\" I whispered in my heart, walking towards the crystal, but nothing happened. \"Uh… Wudons' house?\" Still, no responses. \"…Eh?!\" I started complaining, \"So I must head to Meow Forest fir…\" suddenly, I felt that bright light started covering my body, when I responded, I found that I'm no longer in the Meow Kingdom, the crystal is still here, but what were around had become a dirt path, and plenty of trees. ",
            "I was teleported to the Meow Forest. ",
            "I sighed for the power of magic. Just then, those giant dark shadow flew passed by me again. I looked up, it were those giant birds again! And I realized that they are heading to the south, like what Meimei said. Without hesitation, I walked all the way to the south. About 1 hour later, I walked out of the forest, sooner, I arrived at a house that looks like a lighthouse. According to the sign, this must be Wudons' house. I turned my head left to see where's those islands, and I was completely shocked! They are really sky islands, floating on the sky! The distance between the ocean surface and the lowest area of those islands must have been more than 3000 meters, it's almost impossible to head to here without special methods… ",
            "Just then, the door of that house was open. \"Hi, is there anything wrong with you?\" The meow in the house said, spotted me. I turned my head to him. He was a cat with light yellow fur, but with brown fur on his right ear, hands, wrist and feet, there was also a light bulb on his tail. He must be Wudons. ",
            "\"Uh… Nothing.\" I replied, feeling confused. ",
            "\"You must have some problems! Tell me! I can help you!\" ",
            "\"Uh… Well… I want to go and take a look in the Sky Islands. But it's almost impossible for me.\" ",
            "\"Ah, don't worry!\" Said Wudons, \"Wait for a moment!\" He went upstairs, sooner, he came out with a strange light bulb that looks like a wing and gave it to me. \"Drop this light bulb near yourself, and you'll be able to fly!\" ",
            "\"Really?\" I looked at this light bulb, hesitating, and then dropped this light bulb in front my feet. As the light bulb broke into pieces, I felt that there's a strange magical power flowing into my body. Sooner I found that I got wings on my back! ",
            "\"Try jumping off the cliff and fly!\" Said Wudons. ",
            "I ran to the cliff, jumped off, and tried to move my wings. And I started flying easily, as if I was always able to fly! ",
            "\"Nyahoo!!!\" ",
            "I shouted excitedly. ",
            "\"The feeling of being able to fly is awesome!!!\" ",
            "I was full of excitement, flying around Wudons' house. I saw Wudons smiling at me. ",
            "\"Now use your wings to fly to the Sky Islands!\" Wudons shouted at me. ",
            "\"Sure! Thank you for your light bulb!!!\" I replied him, then with a heart full of excitement, I adjusted my position, and flew directly towards the Sky Islands…",
            "To be continued…"
        ]
    }
]